Documents/ЗаявкаНаВыплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВыплату</Name>
			<BasedOn>
				<xr:Item>Catalog.Проекты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.ВознаграждениеПосредника</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Посредник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВознаграждениеПосредника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ВознаграждениеПосредника</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Посредник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗаявкаНаВыплату/Forms/ФормаДокумента/Ext/Form/Module.bsl
// статьи для ввбора и ручного ввода бюджета расходов
&НаСервере
Функция ДоступныеПроекты( КлиентМенеджер );
	
	// только по клиент менеджеру
	Если НЕ ЗначениеЗаполнено( КлиентМенеджер ) Тогда
		Возврат Неопределено;
	КонецЕсли;
		

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВознаграждениеПосредникаОстатки.Проект,
		|	ВознаграждениеПосредникаОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВознаграждениеПосредника.Остатки(, Проект.МенеджерПроекта = &КлиентМенеджер) КАК ВознаграждениеПосредникаОстатки
		|ГДЕ
		|	ВознаграждениеПосредникаОстатки.СуммаОстаток > 0";
		
	//
	Запрос.УстановитьПараметр("КлиентМенеджер", КлиентМенеджер);
	Результат = Запрос.Выполнить().Выгрузить();

	//
	м = Результат.ВыгрузитьКолонку("Проект");
	Возврат м;
КонецФункции

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	мДоступныхПроектов = ДоступныеПроекты( Объект.КлиентМенеджер );
	Если мДоступныхПроектов <>  Неопределено Тогда
		ЭтаФорма.Элементы.Проект.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.Проект.СписокВыбора.ЗагрузитьЗначения( мДоступныхПроектов );
	Иначе
		// сбрасываем проект
		Объект.Проект 			= "";
		СтандартнаяОбработка 	= Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатокВознаграждения( Проект, Посредник )
	Возврат УП_СметаПроекта.ПолучитьОстатокВознагражденияПоПроекту( Проект, Посредник );
КонецФункции

&НаКлиенте
Процедура УстановитьОстатокВознаграждения()
	ОстатокВознаграждения = ПолучитьОстатокВознаграждения( Объект.Проект, Объект.Посредник );
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	УстановитьОстатокВознаграждения();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОстатокВознаграждения();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОстатокВознаграждения();
КонецПроцедуры

&НаСервереБезКонтекста
Функция мКлМен()
	Возврат МассивКлиентМенджеров()
КонецФункции

&НаКлиенте
Процедура КлиентМенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// клиент менеджеры
	
	мКМ = мКлМен();
	Если мКМ = Неопределено Тогда
	ИначеЕсли мКМ.Количество()  <>   0 Тогда
		ЭтаФорма.Элементы.КлиентМенеджер.РежимВыбораИзСписка=Истина;
		ЭтаФорма.Элементы.КлиентМенеджер.СписокВыбора.ЗагрузитьЗначения( мКМ );
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПосредникПриИзменении(Элемент)
	УстановитьОстатокВознаграждения();
КонецПроцедуры
